       IDENTIFICATION DIVISION.
       PROGRAM-ID. "HelloWorld".
       AUTHOR.     DEVCHRISAR.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           0100-INICIO.
               DISPLAY "HOLA MUNDO!".
       STOP RUN.
       END PROGRAM HelloWorld.
